RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_clk.h
/**
 *******************************************************************************
 * @file  hc32f4a0_clk.h
 * @brief This file contains all the functions prototypes of the CLK driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-07-03       Zhangxl         _DIV64 definition for BUS clock division
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_CLK_H__
#define __HC32F4A0_CLK_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_CLK
 * @{
 */

#if (DDL_CLK_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Types CLK Global Types
 * @{
 */
/**
 * @brief  CLK XTAL configuration structure definition
 */
typedef struct
{
    uint8_t u8XtalState;      /*!< The new state of the XTAL.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8XtalDrv;        /*!< The XTAL drive ability.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8XtalMode;       /*!< The XTAL mode selection osc or exclk.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8XtalStb;        /*!< The XTAL stable time selection.
                                This parameter can be a value of @ref CLK_XTAL_Config   */
} stc_clk_xtal_init_t;

/**
 * @brief  CLK XTALSTD configuration structure definition
 */
typedef struct
{
    uint8_t u8XtalStdState;   /*!< Specifies the new state of XTALSTD.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8XtalStdMode;    /*!< Specifies the XTALSTD mode.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8XtalStdInt;     /*!< Specifies the XTALSTD interrupt on or off.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8XtalStdRst;     /*!< Specifies the XTALSTD reset on or off.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */
} stc_clk_xtalstd_init_t;

/**
 * @brief  CLK XTAL32 configuration structure definition
 */
typedef struct
{
    uint8_t u8Xtal32State;      /*!< Xtal32 new state,
                                    @ref CLK_XTAL32_Config for details */

    uint8_t u8Xtal32Drv;        /*!< Xtal32 drive capacity setting,
                                    @ref CLK_XTAL32_Config for details */

    uint8_t u8Xtal32NF;         /*!< Xtal32 noise filter setting,
                                    @ref CLK_XTAL32_Config for details */
} stc_clk_xtal32_init_t;

/**
 * @brief  CLK PLLH configuration structure definition
 */
typedef struct
{
    uint8_t u8PLLState;         /*!< PLLH new state,
                                    @ref CLK_PLLH_Config for details */
    union
    {
        uint32_t PLLCFGR;       /* PLLH config register */
        struct
        {
            uint32_t PLLM   :2; /*! PLLH M divide */
            uint32_t resvd0 :5; /*! reserved */
            uint32_t PLLSRC :1; /*! PLLH/PLLA source clock select */
            uint32_t PLLN   :8; /*! PLLH N multi- */
            uint32_t resvd1 :4; /*! reserved */
            uint32_t PLLR   :4; /*! PLLH R divide */
            uint32_t PLLQ   :4; /*! PLLH Q divide */
            uint32_t PLLP   :4; /*! PLLH P divide */
        } PLLCFGR_f;
    };
} stc_clk_pllh_init_t;

/**
 * @brief  CLK PLLA configuration structure definition
 */
typedef struct
{
    uint8_t u8PLLState;         /*!< PLLA new state,
                                    @ref CLK_PLLA_Config for details */
    union
    {
        uint32_t PLLCFGR;       /* PLLA config register */
        struct
        {
            uint32_t PLLM   :5; /*!< PLLA M divide */
            uint32_t resvd0 :3; /*! reserved */
            uint32_t PLLN   :9; /*!< PLLA N multi- */
            uint32_t resvd1 :3; /*!< reserved */
            uint32_t PLLR   :4; /*!< PLLA R divide */
            uint32_t PLLQ   :4; /*!< PLLA Q divide */
            uint32_t PLLP   :4; /*!< PLLA P divide */
        } PLLCFGR_f;
    };
} stc_clk_plla_init_t;

/**
 * @brief  CLK bus frequency structure definition
 */
typedef struct
{
    uint32_t sysclkFreq;        /*!< System clock frequency. */
    uint32_t hclkFreq;          /*!< Hclk frequency. */
    uint32_t exckFreq;          /*!< Exclk frequency. */
    uint32_t pclk0Freq;         /*!< Pclk0 frequency. */
    uint32_t pclk1Freq;         /*!< Pclk1 frequency. */
    uint32_t pclk2Freq;         /*!< Pclk2 frequency. */
    uint32_t pclk3Freq;         /*!< Pclk3 frequency. */
    uint32_t pclk4Freq;         /*!< Pclk4 frequency. */
} stc_clk_freq_t;

/**
 * @brief  CLK PLL clock frequency structure definition
 */
typedef struct
{
    uint32_t pllhvcin;              /*!< pllh vcin clock frequency. */
    uint32_t pllhvco;               /*!< pllh vco clock frequency. */
    uint32_t pllhp;                 /*!< pllhp clock frequency. */
    uint32_t pllhq;                 /*!< pllhq clock frequency. */
    uint32_t pllhr;                 /*!< pllhr clock frequency. */
    uint32_t pllavcin;              /*!< plla vcin clock frequency. */
    uint32_t pllavco;               /*!< plla vco clock frequency. */
    uint32_t pllap;                 /*!< pllap clock frequency. */
    uint32_t pllaq;                 /*!< pllaq clock frequency. */
    uint32_t pllar;                 /*!< pllar clock frequency. */
} stc_pll_clk_freq_t;

/**
 * @}
 */

