RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_clk.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup CLK_Global_Functions
 * @{
 */
en_result_t CLK_XtalStdStrucInit(stc_clk_xtalstd_init_t* pstcXtalStdInit);
en_result_t CLK_XtalStdInit(const stc_clk_xtalstd_init_t* pstcXtalStdInit);
void CLK_ClearXtalStdStatus(void);
en_flag_status_t CLK_GetXtalStdStatus(void);

void CLK_HrcTrim(int8_t i8TrimVal);
void CLK_MrcTrim(int8_t i8TrimVal);
void CLK_LrcTrim(int8_t i8TrimVal);
void CLK_RtcLrcTrim(int8_t i8TrimVal);

en_result_t CLK_XtalCmd(en_functional_state_t enNewState);
en_result_t CLK_Xtal32Cmd(en_functional_state_t enNewState);
en_result_t CLK_HrcCmd(en_functional_state_t enNewState);
en_result_t CLK_MrcCmd(en_functional_state_t enNewState);
en_result_t CLK_LrcCmd(en_functional_state_t enNewState);
en_result_t CLK_PLLACmd(en_functional_state_t enNewState);
en_result_t CLK_PLLHCmd(en_functional_state_t enNewState);

en_result_t CLK_PLLAStrucInit(stc_clk_plla_init_t* pstcPLLAInit);
en_result_t CLK_PLLAInit(const stc_clk_plla_init_t *pstcPLLAInit);

en_result_t CLK_PLLHStrucInit(stc_clk_pllh_init_t* pstcPLLHInit);
en_result_t CLK_PLLHInit(const stc_clk_pllh_init_t *pstcPLLHInit);

en_result_t CLK_XtalStrucInit(stc_clk_xtal_init_t* pstcXtalInit);
en_result_t CLK_XtalInit(const stc_clk_xtal_init_t *pstcXtalInit);

en_result_t CLK_Xtal32StrucInit(stc_clk_xtal32_init_t* pstcXtal32Init);
en_result_t CLK_Xtal32Init(const stc_clk_xtal32_init_t *pstcXtal32Init);

en_flag_status_t CLK_GetStableStatus(uint8_t u8StableFlag);

void CLK_SetSysClkSrc(uint8_t u8Src);
void CLK_ClkDiv(uint8_t u8ClkCate, uint32_t u32Div);

void CLK_USB_ClkConfig(uint8_t u8UsbClk);
void CLK_CAN_ClkConfig(uint8_t u8CanCh, uint8_t u8CanClk);
void CLK_I2S_ClkConfig(uint8_t u8I2sCh, uint16_t u16I2sClk);
void CLK_PERI_ClkConfig(uint16_t u16Periclk);

void CLK_TpiuClkCmd(en_functional_state_t enNewState);
void CLK_TpiuClkConfig(uint8_t u8TpiuDiv);

void CLK_MCO1Config(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv);
void CLK_MCO1Cmd(en_functional_state_t enNewState);
void CLK_MCO2Config(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv);
void CLK_MCO2Cmd(en_functional_state_t enNewState);

en_result_t CLK_GetClockFreq(stc_clk_freq_t *pstcClkFreq);
en_result_t CLK_GetPllClockFreq(stc_pll_clk_freq_t *pstcPllClkFreq);
void CLK_SetPLLSrc(uint32_t u32PllSrc);


/**
 * @}
 */

#endif /* DDL_CLK_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32F4A0_CLK_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
